Write a Pandas program to create and display a DataFrame from the following dictionary data which has index labels.
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

1_Print the three first rows using head() method

2_Delete rows with Nan values

3_Extract the 'name' and 'score' columns from the DataFrame.

4_Write a Pandas program to append a new row 'k' to data frame with these values(name : "Suresh", score: 15.5, attempts: 1, qualify: "yes")

5_Write a Pandas program to delete the 'attempts' column from the DataFrame.

6_Add a new column "Success" : if the score is higher than 10 we will have 1 else we will have 0

7_After executing the final dataframe, export it into csv file named "my_data"

6_Add a new column "Success" : if the score is higher than 10 we will have 1 else we will have 0

In [ ]:
import pandas as pd
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily',
                      'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
              'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
              'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
              'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes',
                          'no', 'no', 'yes'],
             'success':[1,0,1,0,0,1,1,0,0,1]}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j' ]
df=pd.DataFrame(exam_data ,index= labels)
df

        name  score  attempts qualify  success
a  Anastasia   12.5         1     yes        1
b       Dima    9.0         3      no        0
c  Katherine   16.5         2     yes        1
d      James    NaN         3      no        0
e      Emily    9.0         2      no        0
f    Michael   20.0         3     yes        1
g    Matthew   14.5         1     yes        1
h      Laura    NaN         1      no        0
i      Kevin    8.0         2      no        0
j      Jonas   19.0         1     yes        1

1_Print the three first rows using head() method

In [ ]:
df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

2_Delete rows with Nan values

In [ ]:
df.dropna(subset = ["score"], inplace=True)

3_Extract the 'name' and 'score' columns from the DataFrame.

In [ ]:
df.iloc[:,0:2]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

4_Write a Pandas program to append a new row 'k' to data frame with these values(name : "Suresh", score: 15.5, attempts: 1, qualify: "yes")

In [ ]:
n2={"name":["Suresh"], "score": [15.5], "attempts": [1], "qualify": ["yes"] ,"success":[1]}
jdfx=["k"]
new_k=pd.DataFrame(n2,index=jdfx)
new_df=pd.concat([df,new_k])
new_df

        name  score  attempts qualify  success
a  Anastasia   12.5         1     yes        1
b       Dima    9.0         3      no        0
c  Katherine   16.5         2     yes        1
d      James    NaN         3      no        0
e      Emily    9.0         2      no        0
f    Michael   20.0         3     yes        1
g    Matthew   14.5         1     yes        1
h      Laura    NaN         1      no        0
i      Kevin    8.0         2      no        0
j      Jonas   19.0         1     yes        1
k     Suresh   15.5         1     yes        1

5_Write a Pandas program to delete the 'attempts' column from the DataFrame.

In [ ]:
df.drop("attempts",axis=1)

        name  score qualify  success
a  Anastasia   12.5     yes        1
b       Dima    9.0      no        0
c  Katherine   16.5     yes        1
d      James    NaN      no        0
e      Emily    9.0      no        0
f    Michael   20.0     yes        1
g    Matthew   14.5     yes        1
h      Laura    NaN      no        0
i      Kevin    8.0      no        0
j      Jonas   19.0     yes        1

7_After executing the final dataframe, export it into csv file named "my_data"

In [ ]:
df.to_csv("df.csv")
my_data=pd.read_csv("df.csv")
my_data.head(10)

  Unnamed: 0       name  score  attempts qualify  success
0          a  Anastasia   12.5         1     yes        1
1          b       Dima    9.0         3      no        0
2          c  Katherine   16.5         2     yes        1
3          d      James    NaN         3      no        0
4          e      Emily    9.0         2      no        0
5          f    Michael   20.0         3     yes        1
6          g    Matthew   14.5         1     yes        1
7          h      Laura    NaN         1      no        0
8          i      Kevin    8.0         2      no        0
9          j      Jonas   19.0         1     yes        1

In [ ]:
df.to_csv (r'C:\Users\Rodina\Downloads\Go My Code.csv', index = False, header=True)